In [4]:
import pandas as pd
retail = pd.read_csv("./retail/retail_2016_2017.csv")
retail.head()

        id        date  store_nbr      family  sales  onpromotion
0  1945944  2016-01-01          1  AUTOMOTIVE    0.0            0
1  1945945  2016-01-01          1   BABY CARE    0.0            0
2  1945946  2016-01-01          1      BEAUTY    0.0            0
3  1945947  2016-01-01          1   BEVERAGES    0.0            0
4  1945948  2016-01-01          1       BOOKS    0.0            0

In [5]:
retail.loc[:,['sales','onpromotion']].sample(100).sum().round(2)

sales          47253.53
onpromotion      813.00
dtype: float64

In [6]:
retail.loc[:,['sales','onpromotion']].sample(100).mean().round(2)

sales          385.98
onpromotion      3.58
dtype: float64

In [7]:
retail.loc[:,['sales','onpromotion']].mean()

sales          457.722487
onpromotion      5.937977
dtype: float64

In [8]:
retail.loc[:,['sales','onpromotion']].std()

sales          1317.154845
onpromotion      18.086321
dtype: float64

### Grouping dataframes

In [9]:
retail.head()

        id        date  store_nbr      family  sales  onpromotion
0  1945944  2016-01-01          1  AUTOMOTIVE    0.0            0
1  1945945  2016-01-01          1   BABY CARE    0.0            0
2  1945946  2016-01-01          1      BEAUTY    0.0            0
3  1945947  2016-01-01          1   BEVERAGES    0.0            0
4  1945948  2016-01-01          1       BOOKS    0.0            0

In [11]:
retail.groupby('family')['sales'].sum().head()

family
AUTOMOTIVE       226139.0
BABY CARE          7903.0
BEAUTY           166189.0
BEVERAGES     105700279.0
BOOKS              6438.0
Name: sales, dtype: float64

In [12]:
retail.groupby('family')[['sales']].sum().head() ## double brackets returen dataframe

                  sales
family
AUTOMOTIVE     226139.0
BABY CARE        7903.0
BEAUTY         166189.0
BEVERAGES   105700279.0
BOOKS            6438.0

In [13]:
retail.groupby('family')[['sales']].mean().sort_values('sales', ascending=False)

                                  sales
family
GROCERY I                   4480.338968
BEVERAGES                   3306.440159
PRODUCE                     2299.909514
CLEANING                    1192.684653
DAIRY                        889.104511
BREAD/BAKERY                 534.690257
POULTRY                      387.135622
MEATS                        361.343401
PERSONAL CARE                318.871778
DELI                         300.856381
HOME CARE                    293.847472
EGGS                         189.385729
FROZEN FOODS                 161.930166
PREPARED FOODS               103.479924
LIQUOR,WINE,BEER              94.052271
HOME AND KITCHEN I            30.963338
HOME AND KITCHEN II           27.721784
SEAFOOD                       22.808709
GROCERY II                    22.714120
CELEBRATION                   13.917073
LADIESWEAR                    11.531657
PLAYERS AND ELECTRONICS       10.608515
LAWN AND GARDEN               10.120026
PET SUPPLIES                   7.407752
AUTOMOTIVE                     7.073918
MAGAZINES                      6.351258
LINGERIE                       6.121747
SCHOOL AND OFFICE SUPPLIES     6.068381
BEAUTY                         5.198605
HARDWARE                       1.292668
HOME APPLIANCES                0.423111
BABY CARE                      0.247216
BOOKS                          0.201389

### Exercise 1 top stores by transactions
-- return top 10 stores by total tx in data

In [15]:
transactions = pd.read_csv("./retail/transactions.csv", parse_dates=["date"])
transactions.head()

        date  store_nbr  transactions
0 2013-01-01         25           770
1 2013-01-02          1          2111
2 2013-01-02          2          2358
3 2013-01-02          3          3487
4 2013-01-02          4          1922

In [16]:
transactions.groupby('store_nbr')['transactions'].sum().sort_values('transactions',ascending=False).head(10)
retail.groupby('family')[['sales']].mean().sort_values('sales', ascending=False)

TypeError: sort_values() takes 1 positional argument but 2 positional arguments (and 1 keyword-only argument) were given